#+TITLE: Example of org to ipynb
#+AUTHOR: John Kitchin

#+ox-ipynb-keyword-metadata: key1 key2

* Introduction

I wrote this module to allow me to write lecture notes in org-mode, but export them to ipython notebooks for my students. It also makes it easier to share my work with people who don't use org-mode (although it is a one-way conversion of org to ipynb).

To use this, you have to require the ox-ipynb library. Then you can export this file with the key sequence =C-c C-e n o= to create the ipynb and open it.

In the following sections I will demonstrate a few features.

** Org-mode markup
   :PROPERTIES:
   :ID:       78E6E264-C6C3-46B8-80D8-05A236497755
   :END:

You should get all the regular markup:

- *bold text*
- /italics/
- _underlined_
- +strikethrough+
- =verbatim=
- ~code~
- superscripts, e.g. H^+
- subscripts, e.g. CH_{4}
- hyperlinks: http://github.com/jkitchin/ox-ipynb
- internal links do not work: [[id:78E6E264-C6C3-46B8-80D8-05A236497755][Org-mode markup]] 

** Embed equations

You can use LaTeX equations like: $\int_0^1 \sin x dx$.

** Embed code and results

Note that code blocks must be either "ipython" or "R", and the first one determines the language used for all of the code blocks.

#+BEGIN_SRC ipython 
import numpy as np
from scipy.integrate import quad

print(quad(lambda x: np.sin(x), 0, 1))
#+END_SRC

#+RESULTS:
:RESULTS:
(0.45969769413186023, 5.103669643922839e-15)

:END:


Here we force a new cell to be created with the =ipynb-newcell= directive.
#+ipynb-newcell

This text should be in its own cell.

** Embed tables

You can create tables and they render nicely in the notebook. Note that you probably should not use the tables as data sources to code blocks because the ipython notebook does not support that.

#+caption: A table of numbers.
| x | y |
|---+---|
| 1 | 1 |
| 2 | 4 |
| 3 | 9 |

